Autodesk.Revit.UI.Tab
An enumerated type listing static tabs which support addition of panels via the API.

Autodesk.Revit.UI.Tab.Analyze
The Analyze tab.

Autodesk.Revit.UI.Tab.AddIns
The Add-Ins tab.